<template>
  <n-tabs type="segment" animated class="select-none">
    <n-tab-pane name="chap1" tab="对话">
      <n-list hoverable clickable v-if="chatStore.chats?.length">
        <n-list-item
          v-for="c in chatStore.chats"
          :key="c.id"
          :class="
            c.id === chatStore.currentChatId
              ? ' bg-gray-100 dark:bg-gray-700'
              : ''
          "
          @click="viewChat(c.id ?? 0)"
        >
          <n-thing> {{ c.name }} </n-thing>
        </n-list-item>
      </n-list>
      <div v-else>
        <n-result
          status="404"
          title="你还没有对话"
          description="不如现在就开始？"
        >
        </n-result>
      </div>
    </n-tab-pane>
    <n-tab-pane name="chap2" tab="助理">
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
      “威尔！着火了！快来帮忙！”我听到女朋友大喊。现在一个难题在我面前——是恢复一个重要的
      Amazon 服务，还是救公寓的火。<br /><br />
      我的脑海中忽然出现了 Amazon
      著名的领导力准则”客户至上“，有很多的客户还依赖我们的服务，我不能让他们失望！所以着火也不管了，女朋友喊我也无所谓，我开始
      debug 这个线上问题。
    </n-tab-pane>
  </n-tabs>
</template>

<script setup lang="ts">
import { NMenu } from "naive-ui";
import { useRoute } from "vue-router";
import { leftMenuOptions } from "../plugins/menus/left";
import { ChatboxOutline } from "@vicons/ionicons5";
import getApi from "../plugins/api";
import { useChatStore } from "../stores/chat";
import router from "@/router";

const route = useRoute();
// @ts-ignore
const chatId = route.params.id as number;

const currentRoute: any = computed(() => route.name);

const collapsed = ref(false);

const chatStore = useChatStore();

async function getChats() {
  chatStore.chats = (await getApi().Chat.apiV1ChatsGet()).data.data;
}

const viewChat = (chatId: number) => {
  router.push("/chat/" + chatId);
};

getChats();
</script>
